apache/nuttx/arch/arm/src/stm32h7/stm32_clk.c
/****************************************************************************
 * arch/arm/src/stm32h7/stm32_rcc.c
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>
#include <nuttx/clk/clk.h>
#include <nuttx/clk/clk_provider.h>
#include <sys/param.h>
#include <arch/board/board.h>

#include "arm_internal.h"
#include "stm32_clk.h"
#include "hardware/stm32h7x3xx_rcc.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* Oscillator frequencies */

#define STM32_HSI_FREQUENCY     64000000u
#define STM32_CSI_FREQUENCY     4000000u
#define STM32_HSI48_FREQUENCY   48000000u
#define STM32_LSI_FREQUENCY     32000u

/* Helper macro to define a gate configuration (for nested use) */

#define STM32_GATE(_name, _reg, _bit, _flags)                                \
  { .gate_name = _name,                                                      \
    .gate = {                                                                \
      .reg = _reg,                                                           \
      .bit_idx = _bit,                                                       \
      .flags = _flags                                                        \
    }                                                                        \
  }

/* Helper macro to define a divider configuration (for nested use) */

#define STM32_DIVIDER(_name, _reg, _shift, _width, _flags)                   \
  { .div_name = _name,                                                       \
    .div = {                                                                 \
      .reg = _reg,                                                           \
      .shift = _shift,                                                       \
      .width = _width,                                                       \
      .flags = _flags                                                        \
    }                                                                        \
  }

/* Helper macro to define a mux configuration (for nested use) */

#define STM32_MUX(_name, _reg, _shift, _width, _flags)                       \
  { .mux_name = _name,                                                       \
    .mux = {                                                                 \
      .reg = _reg,                                                           \
      .shift = _shift,                                                       \
      .width = _width,                                                       \
      .flags = _flags                                                        \
    }                                                                        \
  }

/* Helper macro to define a fixed rate configuration (for nested use) */

#define STM32_FIXED_RATE(_name, _rate, _flags)                               \
  {                                                                          \
    .fixed_rate_name = _name,                                                \
    .fixed_rate = {                                                          \
      .fixed_rate = _rate,                                                   \
      .flags = _flags,                                                       \
    }                                                                        \
  }

/* Helper macro to define a multiplier configuration (for nested use) */

#define STM32_MULTIPLIER(_name, _reg, _shift, _width, _flags)                \
  {                                                                          \
    .mult_name = _name,                                                      \
    .mult = {                                                                \
      .reg = _reg,                                                           \
      .shift = _shift,                                                       \
      .width = _width,                                                       \
      .flags = _flags                                                        \
    }                                                                        \
  }

/* Macro to define N-gated fixed rate oscillators */

#define STM32_GATED_FIXED_RATE_N(_fixed_rate, _flags, _num_gates, ...)        \
{                                                                            \
  .num_gates = _num_gates,                                                   \
  .base_flags = _flags,                                                      \
  .fixed_rate = _fixed_rate,                                                 \
  .gates = (const struct stm32_gate_s []) { __VA_ARGS__ },                   \
}

/* Macro to define N-gated mux with variadic gates */

#define STM32_GATED_MUX_N(_parents, _parents_n, _mux, _flags, _num_gates, ...)\
{                                                                            \
  .parent_names = _parents,                                                  \
  .parent_names_count = _parents_n,                                          \
  .num_gates = _num_gates,                                                   \
  .base_flags = _flags,                                                      \
  .mux = _mux,                                                               \
  .gates = (const struct stm32_gate_s []) { __VA_ARGS__ }                    \
}

/* Macro to define PLL configuration */

