apache/nuttx/arch/arm/src/stm32h7/stm32_clk.c
#define STM32_PLL(_parent, _flags, _divn, _divp, _divq, _divr,               \
                  _gatep, _gateq, _gater)                                    \
{                                                                            \
  .parent_name = _parent,                                                    \
  .base_flags = _flags,                                                      \
  .divn = _divn,                                                             \
  .divp = _divp,                                                             \
  .divq = _divq,                                                             \
  .divr = _divr,                                                             \
  .gatep = _gatep,                                                           \
  .gateq = _gateq,                                                           \
  .gater = _gater,                                                           \
}

/* Macro to define divided mux with multiple dividers */

#define STM32_DIVIDED_MUX_N(_parents, _parents_n, _mux, _flags, _num_divs, ...)\
{                                                                            \
  .parent_names = _parents,                                                  \
  .parent_names_count = _parents_n,                                          \
  .num_divs = _num_divs,                                                     \
  .base_flags = _flags,                                                      \
  .mux = _mux,                                                               \
  .divs = (const struct stm32_divider_s []) { __VA_ARGS__ }                  \
}

/* Macro to define system clock */

#define STM32_SYSCLK(_sysclk_parents, _sysclk_parents_n, _sysclk_mux,        \
                     _traceclk_parents, _traceclk_parents_n, _traceclk_mux,  \
                     _flags, _cdcpre, _hpre, _cdppre, _cdppre1, _cdppre2,    \
                     _sdrppre)                                               \
{                                                                            \
  .sysclk_parent_names = _sysclk_parents,                                    \
  .sysclk_parent_names_count = _sysclk_parents_n,                            \
  .traceclk_parent_names = _traceclk_parents,                                \
  .traceclk_parent_names_count = _traceclk_parents_n,                        \
  .base_flags = _flags,                                                      \
  .sysclk_mux = _sysclk_mux,                                                 \
  .traceclk_mux = _traceclk_mux,                                             \
  .cdcpre = _cdcpre,                                                         \
  .hpre = _hpre,                                                             \
  .cdppre = _cdppre,                                                         \
  .cdppre1 = _cdppre1,                                                       \
  .cdppre2 = _cdppre2,                                                       \
  .sdrppre = _sdrppre,                                                       \
}

/****************************************************************************
 * Private Types
 ****************************************************************************/

struct stm32_gate_s
{
  const char *gate_name;
  struct clk_gate_s gate;
};

struct stm32_fixed_rate_s
{
  const char *fixed_rate_name;
  struct clk_fixed_rate_s fixed_rate;
};

struct stm32_multiplier_s
{
  const char *mult_name;
  struct clk_multiplier_s mult;
};

struct stm32_divider_s
{
  const char *div_name;
  struct clk_divider_s div;
};

struct stm32_mux_s
{
  const char *mux_name;
  struct clk_mux_s mux;
};

/* Oscillators configuration */

struct stm32_gated_fixed_rate_s
{
  const uint8_t num_gates;
  const uint8_t base_flags;

  const struct stm32_gate_s *gates;
  struct stm32_fixed_rate_s fixed_rate;
};

/* PLL configuration */

struct stm32_pll_s
{
  const char *parent_name;

  const uint8_t base_flags;

  struct stm32_multiplier_s divn;
  struct stm32_divider_s divp;
  struct stm32_divider_s divq;
  struct stm32_divider_s divr;
  struct stm32_gate_s gatep;
  struct stm32_gate_s gateq;
  struct stm32_gate_s gater;
};

struct stm32_sysclk_s
{
  const char * const *sysclk_parent_names;
  const int sysclk_parent_names_count;
  const char * const *traceclk_parent_names;
  const int traceclk_parent_names_count;

  const uint8_t base_flags;

  struct stm32_mux_s sysclk_mux;
  struct stm32_mux_s traceclk_mux;
  struct stm32_divider_s cdcpre;
  struct stm32_divider_s hpre;
  struct stm32_divider_s cdppre;
  struct stm32_divider_s cdppre1;
  struct stm32_divider_s cdppre2;
  struct stm32_divider_s sdrppre;
};

struct stm32_gated_mux_s
{
  const char * const *parent_names;
  const int parent_names_count;

  const char *mux_name;

  const uint8_t num_gates;
  const uint8_t base_flags;

  const struct stm32_gate_s *gates;
  struct stm32_mux_s mux;
};

/* Divided mux with multiple dividers configuration */

struct stm32_divided_mux_n_s
{
  const char * const *parent_names;
  const int parent_names_count;

  const uint8_t num_divs;
  const uint8_t base_flags;

  const struct stm32_divider_s *divs;
  struct stm32_mux_s mux;
};

/****************************************************************************
 * Private Data
 ****************************************************************************/

/* STM32H7 gated oscillators */

static const struct stm32_gated_fixed_rate_s stm32h7_gated_oscs[] =
{
  STM32_GATED_FIXED_RATE_N(
    STM32_FIXED_RATE("csi", STM32_CSI_FREQUENCY, 0),
    CLK_IS_CRITICAL | CLK_NAME_IS_STATIC,
    2,
    STM32_GATE("csi_ck", STM32_RCC_CR, 7, 0),
    STM32_GATE("csi_ker_ck", STM32_RCC_CR, 9, 0)
  ),
  STM32_GATED_FIXED_RATE_N(
    STM32_FIXED_RATE("hse", STM32_HSE_FREQUENCY, 0),
    CLK_IS_CRITICAL | CLK_NAME_IS_STATIC,
    1,
    STM32_GATE("hse_ck", STM32_RCC_CR, 16, 0)
  ),
  STM32_GATED_FIXED_RATE_N(
    STM32_FIXED_RATE("hsi48", STM32_HSI48_FREQUENCY, 0),
    CLK_IS_CRITICAL | CLK_NAME_IS_STATIC,
    1,
    STM32_GATE("hsi48_ck", STM32_RCC_CR, 12, 0)
  ),
  STM32_GATED_FIXED_RATE_N(
    STM32_FIXED_RATE("lsi", STM32_LSI_FREQUENCY, 0),
    CLK_IS_CRITICAL | CLK_NAME_IS_STATIC,
    1,
    STM32_GATE("lsi_ck", STM32_RCC_CSR, 0, 0)
  ),
  STM32_GATED_FIXED_RATE_N(
    STM32_FIXED_RATE("hsi", STM32_HSI_FREQUENCY, 0),
    CLK_IS_CRITICAL | CLK_NAME_IS_STATIC,
    0
  ),
  STM32_GATED_FIXED_RATE_N(
    STM32_FIXED_RATE("lse", STM32_LSE_FREQUENCY, 0),
    CLK_IS_CRITICAL | CLK_NAME_IS_STATIC,
    1,
    STM32_GATE("lse_ck", STM32_RCC_BDCR, 0, 0)
  ),
};

