apache/nuttx/arch/arm/src/stm32h7/stm32_clk.c
/* STM32H7 PLL clock selection parent names */

static const char * const pll_cksel_parents[] =
{
  "hsi_ck", "csi_ck", "hse_ck", "off"
};

/* STM32H7 PLL clock selection */

static const struct stm32_divided_mux_n_s stm32h7_pll_cksel =
  STM32_DIVIDED_MUX_N(
    pll_cksel_parents,
    nitems(pll_cksel_parents),
    STM32_MUX(
      "pllsrc",
      STM32_RCC_PLLCKSELR,
      RCC_PLLCKSELR_PLLSRC_SHIFT,
      2,
      CLK_MUX_SET_RATE_NO_REPARENT
    ),
    CLK_NAME_IS_STATIC | CLK_PARENT_NAME_IS_STATIC,
    3,
    STM32_DIVIDER(
      "divm1",
      STM32_RCC_PLLCKSELR,
      RCC_PLLCKSELR_DIVM1_SHIFT,
      6,
      CLK_DIVIDER_ONE_BASED
    ),
    STM32_DIVIDER(
      "divm2",
      STM32_RCC_PLLCKSELR,
      RCC_PLLCKSELR_DIVM2_SHIFT,
      6,
      CLK_DIVIDER_ONE_BASED
    ),
    STM32_DIVIDER(
      "divm3",
      STM32_RCC_PLLCKSELR,
      RCC_PLLCKSELR_DIVM3_SHIFT,
      6,
      CLK_DIVIDER_ONE_BASED
    )
  );

/* STM32H7 PLLs */

static const struct stm32_pll_s stm32h7_plls[] =
{
  STM32_PLL(
    "divm1",
    CLK_NAME_IS_STATIC  | CLK_PARENT_NAME_IS_STATIC | 
    CLK_SET_RATE_PARENT | CLK_GET_RATE_NOCACHE,
    STM32_MULTIPLIER(
      "divn1",
      STM32_RCC_PLL1DIVR,
      RCC_PLLDIVR_N_SHIFT,
      9,
      CLK_MULT_ONE_BASED | CLK_MULT_ROUND_CLOSEST
    ),
    STM32_DIVIDER(
      "divp1",
      STM32_RCC_PLL1DIVR,
      RCC_PLLDIVR_P_SHIFT,
      7,
      CLK_DIVIDER_DIV_NEED_EVEN | CLK_DIVIDER_ROUND_CLOSEST
    ),
    STM32_DIVIDER(
      "divq1",
      STM32_RCC_PLL1DIVR,
      RCC_PLLDIVR_Q_SHIFT,
      7,
      CLK_DIVIDER_ROUND_CLOSEST
    ),
    STM32_DIVIDER(
      "divr1",
      STM32_RCC_PLL1DIVR,
      RCC_PLLDIVR_R_SHIFT,
      7,
      CLK_DIVIDER_ROUND_CLOSEST
    ),
    STM32_GATE(
      "pll1_p_ck",
      STM32_RCC_PLLCFGR,
      RCC_PLLCFGR_DIVP1EN_SHIFT,
      0
    ),
    STM32_GATE(
      "pll1_q_ck",
      STM32_RCC_PLLCFGR,
      RCC_PLLCFGR_DIVQ1EN_SHIFT,
      0
    ),
    STM32_GATE(
      "pll1_r_ck",
      STM32_RCC_PLLCFGR,
      RCC_PLLCFGR_DIVR1EN_SHIFT,
      0
    )
  ),
  STM32_PLL(
    "divm2",
    CLK_NAME_IS_STATIC | CLK_PARENT_NAME_IS_STATIC | CLK_SET_RATE_PARENT | CLK_GET_RATE_NOCACHE,
    STM32_MULTIPLIER(
      "divn2",
      STM32_RCC_PLL2DIVR,
      RCC_PLLDIVR_N_SHIFT,
      9,
      CLK_MULT_ONE_BASED | CLK_MULT_ROUND_CLOSEST
    ),
    STM32_DIVIDER(
      "divp2",
      STM32_RCC_PLL2DIVR,
      RCC_PLLDIVR_P_SHIFT,
      7,
      CLK_DIVIDER_ONE_BASED | CLK_DIVIDER_ROUND_CLOSEST
    ),
    STM32_DIVIDER(
      "divq2",
      STM32_RCC_PLL2DIVR,
      RCC_PLLDIVR_Q_SHIFT,
      7,
      CLK_DIVIDER_ROUND_CLOSEST
    ),
    STM32_DIVIDER(
      "divr2",
      STM32_RCC_PLL2DIVR,
      RCC_PLLDIVR_R_SHIFT,
      7,
      CLK_DIVIDER_ROUND_CLOSEST
    ),
    STM32_GATE(
      "pll2_p_ck",
      STM32_RCC_PLLCFGR,
      RCC_PLLCFGR_DIVP2EN_SHIFT,
      0
    ),
    STM32_GATE(
      "pll2_q_ck",
      STM32_RCC_PLLCFGR,
      RCC_PLLCFGR_DIVQ2EN_SHIFT,
      0
    ),
    STM32_GATE(
      "pll2_r_ck",
      STM32_RCC_PLLCFGR,
      RCC_PLLCFGR_DIVR2EN_SHIFT,
      0
    )
  ),
  STM32_PLL(
    "divm3",
    CLK_NAME_IS_STATIC | CLK_PARENT_NAME_IS_STATIC | CLK_SET_RATE_PARENT | CLK_GET_RATE_NOCACHE,
    STM32_MULTIPLIER(
      "divn3",
      STM32_RCC_PLL3DIVR,
      RCC_PLLDIVR_N_SHIFT,
      9,
      CLK_MULT_ONE_BASED | CLK_MULT_ROUND_CLOSEST
    ),
    STM32_DIVIDER(
      "divp3",
      STM32_RCC_PLL3DIVR,
      RCC_PLLDIVR_P_SHIFT,
      7,
      CLK_DIVIDER_ONE_BASED | CLK_DIVIDER_ROUND_CLOSEST
    ),
    STM32_DIVIDER(
      "divq3",
      STM32_RCC_PLL3DIVR,
      RCC_PLLDIVR_Q_SHIFT,
      7,
      CLK_DIVIDER_ROUND_CLOSEST
    ),
    STM32_DIVIDER(
      "divr3",
      STM32_RCC_PLL3DIVR,
      RCC_PLLDIVR_R_SHIFT,
      7,
      CLK_DIVIDER_ROUND_CLOSEST
    ),
    STM32_GATE(
      "pll3_p_ck",
      STM32_RCC_PLLCFGR,
      RCC_PLLCFGR_DIVP3EN_SHIFT,
      0
    ),
    STM32_GATE(
      "pll3_q_ck",
      STM32_RCC_PLLCFGR,
      RCC_PLLCFGR_DIVQ3EN_SHIFT,
      0
    ),
    STM32_GATE(
      "pll3_r_ck",
      STM32_RCC_PLLCFGR,
      RCC_PLLCFGR_DIVR3EN_SHIFT,
      0
    )
  ),
};

/* STM32H7 system clock parent names */

static const char * const sysclk_parents[] =
{
  "hsi_ck", "csi_ck", "hse_ck", "pll1_p_ck"
};

static const char * const traceclk_parents[] =
{
  "hsi_ck", "csi_ck", "hse_ck", "pll1_r_ck"
};

/* STM32H7 system clock */

static const struct stm32_sysclk_s stm32h7_sysclk =
  STM32_SYSCLK(
    sysclk_parents,
    nitems(sysclk_parents),
    STM32_MUX(
      "sys_ck",
      STM32_RCC_CFGR,
      RCC_CFGR_SW_SHIFT,
      3,
      CLK_MUX_SET_RATE_NO_REPARENT
    ),
    traceclk_parents,
    nitems(traceclk_parents),
    STM32_MUX(
      "traceportck",
      STM32_RCC_CFGR,
      RCC_CFGR_SW_SHIFT,
      1,
      CLK_MUX_SET_RATE_NO_REPARENT
    ),
    CLK_NAME_IS_STATIC | CLK_PARENT_NAME_IS_STATIC | CLK_SET_RATE_PARENT | CLK_GET_RATE_NOCACHE,
    STM32_DIVIDER(
      "cdcpre",
      STM32_RCC_D1CFGR,
      RCC_D1CFGR_D1CPRE_SHIFT,
      4,
      CLK_DIVIDER_POWER_OF_TWO | (8 << CLK_DIVIDER_MINDIV_OFF) |
      CLK_DIVIDER_APPLY_OFFSET | CLK_DIVIDER_ROUND_CLOSEST
    ),
    STM32_DIVIDER(
      "hpre",
      STM32_RCC_D1CFGR,
      RCC_D1CFGR_HPRE_SHIFT,
      4,
      CLK_DIVIDER_POWER_OF_TWO | (8 << CLK_DIVIDER_MINDIV_OFF) |
      CLK_DIVIDER_APPLY_OFFSET | CLK_DIVIDER_ROUND_CLOSEST
    ),
    STM32_DIVIDER(
      "cdppre",
      STM32_RCC_D1CFGR,
      RCC_D1CFGR_D1PPRE_SHIFT,
      3,
      CLK_DIVIDER_POWER_OF_TWO | (4 << CLK_DIVIDER_MINDIV_OFF) |
      CLK_DIVIDER_APPLY_OFFSET | CLK_DIVIDER_ROUND_CLOSEST
    ),
    STM32_DIVIDER(
      "cdppre1",
      STM32_RCC_D2CFGR,
      RCC_D2CFGR_D2PPRE1_SHIFT,
      3,
      CLK_DIVIDER_POWER_OF_TWO | (4 << CLK_DIVIDER_MINDIV_OFF) |
      CLK_DIVIDER_APPLY_OFFSET | CLK_DIVIDER_ROUND_CLOSEST
    ),
    STM32_DIVIDER(
      "cdppre2",
      STM32_RCC_D2CFGR,
      RCC_D2CFGR_D2PPRE2_SHIFT,
      3,
      CLK_DIVIDER_POWER_OF_TWO | (4 << CLK_DIVIDER_MINDIV_OFF) |
      CLK_DIVIDER_APPLY_OFFSET | CLK_DIVIDER_ROUND_CLOSEST
    ),
    STM32_DIVIDER(
      "sdrppre",
      STM32_RCC_D3CFGR,
      RCC_D3CFGR_D3PPRE_SHIFT,
      3,
      CLK_DIVIDER_POWER_OF_TWO | (4 << CLK_DIVIDER_MINDIV_OFF) |
      CLK_DIVIDER_APPLY_OFFSET | CLK_DIVIDER_ROUND_CLOSEST
    )
  );

/* STM32H7 gated muxes parent names */

static const char * const sdmmcsel_parents[] =
{
  "pll1_q_ck", "pll2_r_ck"
};

static const char * const qspisel_parents[] =
{
  "hpre", "pll1_q_ck", "pll2_r_ck", "per_ck"
};

static const char * const ckpersel_parents[] =
{
  "hsi_ker_ck", "csi_ker_ck", "hse_ck"
};

