apache/nuttx/arch/arm/src/stm32h7/stm32_clk.c
static const char * const fmcsel_parents[] =
{
  "hpre", "pll1_q_ck", "pll2_r_ck", "per_ck"
};

static const char * const swpsel_parents[] =
{
  "cdppre1", "hsi_ker_ck"
};

static const char * const fdcansel_parents[] =
{
  "hse_ck", "pll1_q_ck", "pll2_q_ck"
};

static const char * const dfsdm1sel_parents[] =
{
  "cdppre2", "sysclk"
};

static const char * const spdifsel_parents[] =
{
  "pll1_q_ck", "pll2_r_ck", "pll3_r_ck", "hsi_ker_ck"
};

static const char * const spi45sel_parents[] =
{
  "cdppre2", "pll2_r_ck", "pll3_r_ck",
  "hsi_ker_ck", "csi_ker_ck", "hse_ck"
};

static const char * const spi123sel_parents[] =
{
  "pll1_q_ck", "pll2_p_ck", "pll3_p_ck",
  "i2s_ckin", "per_ck"
};

static const char * const sai23sel_parents[] =
{
  "pll1_q_ck", "pll2_p_ck", "pll3_p_ck",
  "i2s_ckin", "per_ck"
};

static const char * const sai1sel_parents[] =
{
  "pll1_q_ck", "pll2_p_ck", "pll3_p_ck",
  "i2s_ckin", "per_ck"
};

static const char * const lptim1sel_parents[] =
{
  "cdppre1", "pll2_p_ck", "pll3_r_ck",
  "lse_ck", "lsi_ck", "per_ck"
};

static const char * const cecsel_parents[] =
{
  "lse_ck", "lsi_ck", "csi_ker_ck"
};

static const char * const usbsel_parents[] =
{
  "pll1_q_ck", "pll3_q_ck", "hsi48_ck"
};

static const char * const i2c123sel_parents[] =
{
  "cdppre1", "pll3_r_ck", "hsi_ker_ck", "csi_ker_ck"
};

static const char * const rngsel_parents[] =
{
  "hsi48_ck", "pll1_q_ck", "lse_ck", "lsi_ck"
};

static const char * const usart16sel_parents[] =
{
  "cdppre2", "pll2_r_ck", "pll3_r_ck",
  "hsi_ker_ck", "csi_ker_ck", "lse_ck"
};

static const char * const usart234578sel_parents[] =
{
  "cdppre1", "pll2_r_ck", "pll3_r_ck",
  "hsi_ker_ck", "csi_ker_ck", "lse_ck"
};

static const char * const spi6sel_parents[] =
{
  "sdrppre", "pll2_r_ck", "pll3_r_ck",
  "hsi_ker_ck", "csi_ker_ck", "hse_ck"
};

static const char * const sai4bsel_parents[] =
{
  "pll1_q_ck", "pll2_p_ck", "pll3_p_ck",
  "i2s_ckin", "per_ck"
};

static const char * const sai4asel_parents[] =
{
  "pll1_q_ck", "pll2_p_ck", "pll3_p_ck",
  "i2s_ckin", "per_ck"
};

static const char * const adcsel_parents[] =
{
  "pll2_p_ck", "pll3_r_ck", "per_ck"
};

static const char * const lptim345sel_parents[] =
{
  "sdrppre", "pll2_p_ck", "pll3_r_ck",
  "lse_ck", "lsi_ck", "per_ck"
};

static const char * const lptim2sel_parents[] =
{
  "sdrppre", "pll2_p_ck", "pll3_r_ck",
  "lse_ck", "lsi_ck", "per_ck"
};

static const char * const i2c4sel_parents[] =
{
  "sdrppre", "pll3_r_ck", "hsi_ker_ck", "csi_ker_ck"
};

static const char * const lpuart1sel_parents[] =
{
  "sdrppre", "pll2_r_ck", "pll3_r_ck",
  "hsi_ker_ck", "csi_ker_ck", "lse_ck"
};

/* STM32H7 gated muxes */

static const struct stm32_gated_mux_s stm32h7_gated_muxes[] =
{
  STM32_GATED_MUX_N(
    ckpersel_parents, nitems(ckpersel_parents),
    STM32_MUX(
        "per_ck", STM32_RCC_D1CCIPR, RCC_D1CCIPR_CKPERSEL_SHIFT, 2,
        CLK_MUX_SET_RATE_NO_REPARENT
    ),
    CLK_NAME_IS_STATIC | CLK_PARENT_NAME_IS_STATIC | CLK_SET_RATE_PARENT,
    0
  ),
  STM32_GATED_MUX_N(
    sdmmcsel_parents, nitems(sdmmcsel_parents),
    STM32_MUX(
      "sdmmcsel",
      STM32_RCC_D1CCIPR,
      RCC_D1CCIPR_SDMMC_SHIFT,
      1,
      CLK_MUX_ROUND_CLOSEST
    ),
    CLK_NAME_IS_STATIC | CLK_PARENT_NAME_IS_STATIC | CLK_SET_RATE_PARENT,
    2,
    STM32_GATE("sdmmc1_ker_ck", STM32_RCC_AHB3ENR, 16, 0),
    STM32_GATE("sdmmc2_ker_ck", STM32_RCC_AHB2ENR, 9, 0)
  ),
  STM32_GATED_MUX_N(
    qspisel_parents, nitems(qspisel_parents),
    STM32_MUX(
      "qspisel",
      STM32_RCC_D1CCIPR,
      RCC_D1CCIPR_QSPISEL_SHIFT,
      2,
      CLK_MUX_ROUND_CLOSEST
    ),
    CLK_NAME_IS_STATIC | CLK_PARENT_NAME_IS_STATIC | CLK_SET_RATE_PARENT,
    1,
    STM32_GATE("quadspi_ker_ck", STM32_RCC_AHB3ENR, 14, 0)
  ),
  STM32_GATED_MUX_N(
    fmcsel_parents, nitems(fmcsel_parents),
    STM32_MUX(
      "fmcsel",
      STM32_RCC_D1CCIPR,
      RCC_D1CCIPR_FMCSEL_SHIFT,
      2,
      CLK_MUX_ROUND_CLOSEST
    ),
    CLK_NAME_IS_STATIC | CLK_PARENT_NAME_IS_STATIC | CLK_SET_RATE_PARENT,
    1,
    STM32_GATE("fmc_ker_ck", STM32_RCC_AHB3ENR, 12, 0)
  ),
  STM32_GATED_MUX_N(
    swpsel_parents, nitems(swpsel_parents),
    STM32_MUX(
      "swpsel",
      STM32_RCC_D2CCIP1R,
      RCC_D2CCIP1R_SWPSEL_SHIFT,
      1,
      CLK_MUX_ROUND_CLOSEST
    ),
    CLK_NAME_IS_STATIC | CLK_PARENT_NAME_IS_STATIC | CLK_SET_RATE_PARENT,
    1,
    STM32_GATE("swpmi_ker_ck", STM32_RCC_APB3ENR, 2, 0)
  ),
  STM32_GATED_MUX_N(
    fdcansel_parents, nitems(fdcansel_parents),
    STM32_MUX(
      "fdcansel",
      STM32_RCC_D2CCIP1R,
      RCC_D2CCIP1R_FDCANSEL_SHIFT,
      2,
      CLK_MUX_ROUND_CLOSEST
    ),
    CLK_NAME_IS_STATIC | CLK_PARENT_NAME_IS_STATIC | CLK_SET_RATE_PARENT,
    1,
    STM32_GATE("fdcan_ker_ck", STM32_RCC_APB1HENR, 8, 0)
  ),
  STM32_GATED_MUX_N(
    dfsdm1sel_parents, nitems(dfsdm1sel_parents),
    STM32_MUX(
      "dfsdm1sel",
      STM32_RCC_D2CCIP1R,
      RCC_D2CCIP1R_DFSDM1SEL_SHIFT,
      1,
      CLK_MUX_ROUND_CLOSEST
    ),
    CLK_NAME_IS_STATIC | CLK_PARENT_NAME_IS_STATIC | CLK_SET_RATE_PARENT,
    1,
    STM32_GATE("dfsdm1_ker_ck", STM32_RCC_APB2ENR, 28, 0)
  ),
  STM32_GATED_MUX_N(
    spdifsel_parents, nitems(spdifsel_parents),
    STM32_MUX(
      "spdifsel",
      STM32_RCC_D2CCIP1R,
      RCC_D2CCIP1R_SPDIFSEL_SHIFT,
      2,
      CLK_MUX_ROUND_CLOSEST
    ),
    CLK_NAME_IS_STATIC | CLK_PARENT_NAME_IS_STATIC | CLK_SET_RATE_PARENT,
    1,
    STM32_GATE("spdifrx_ker_ck", STM32_RCC_APB1LENR, 16, 0)
  ),
  STM32_GATED_MUX_N(
    spi45sel_parents, nitems(spi45sel_parents),
    STM32_MUX(
      "spi45sel",
      STM32_RCC_D2CCIP1R,
      RCC_D2CCIP1R_SPI45SEL_SHIFT,
      3,
      CLK_MUX_ROUND_CLOSEST
    ),
    CLK_NAME_IS_STATIC | CLK_PARENT_NAME_IS_STATIC | CLK_SET_RATE_PARENT,
    2,
    STM32_GATE("spi4_ker_ck", STM32_RCC_APB2ENR, 13, 0),
    STM32_GATE("spi5_ker_ck", STM32_RCC_APB2ENR, 20, 0)
  ),
  STM32_GATED_MUX_N(
    spi123sel_parents, nitems(spi123sel_parents),
    STM32_MUX(
      "spi123sel",
      STM32_RCC_D2CCIP1R,
      RCC_D2CCIP1R_SPI123SEL_SHIFT,
      3,
      CLK_MUX_ROUND_CLOSEST
    ),
    CLK_NAME_IS_STATIC | CLK_PARENT_NAME_IS_STATIC | CLK_SET_RATE_PARENT,
    3,
    STM32_GATE("spi1_ker_ck", STM32_RCC_APB2ENR, 12, 0),
    STM32_GATE("spi2_ker_ck", STM32_RCC_APB1LENR, 14, 0),
    STM32_GATE("spi3_ker_ck", STM32_RCC_APB1LENR, 15, 0)
  ),
  STM32_GATED_MUX_N(
    sai23sel_parents, nitems(sai23sel_parents),
    STM32_MUX(
      "sai23sel",
      STM32_RCC_D2CCIP1R,
      RCC_D2CCIP1R_SAI23SEL_SHIFT,
      3,
      CLK_MUX_ROUND_CLOSEST
    ),
    CLK_NAME_IS_STATIC | CLK_PARENT_NAME_IS_STATIC | CLK_SET_RATE_PARENT,
    2,
    STM32_GATE("sai2_ker_ck", STM32_RCC_APB2ENR, 22, 0),
    STM32_GATE("sai3_ker_ck", STM32_RCC_APB2ENR, 23, 0)
  ),
  STM32_GATED_MUX_N(
    sai1sel_parents, nitems(sai1sel_parents),
    STM32_MUX(
      "sai1sel",
      STM32_RCC_D2CCIP1R,
      RCC_D2CCIP1R_SAI1SEL_SHIFT,
      3,
      CLK_MUX_ROUND_CLOSEST
    ),
    CLK_NAME_IS_STATIC | CLK_PARENT_NAME_IS_STATIC | CLK_SET_RATE_PARENT,
    1,
    STM32_GATE("sai1_ker_ck", STM32_RCC_APB2ENR, 22, 0)
  ),
  STM32_GATED_MUX_N(
    lptim1sel_parents, nitems(lptim1sel_parents),
    STM32_MUX(
      "lptim1sel",
      STM32_RCC_D2CCIP2R,
      RCC_D2CCIP2R_LPTIM1SEL_SHIFT,
      3,
      CLK_MUX_ROUND_CLOSEST
    ),
    CLK_NAME_IS_STATIC | CLK_PARENT_NAME_IS_STATIC | CLK_SET_RATE_PARENT,
    1,
    STM32_GATE("lptim1_ker_ck", STM32_RCC_APB1LENR, 9, 0)
  ),
  STM32_GATED_MUX_N(
    cecsel_parents, nitems(cecsel_parents),
    STM32_MUX(
      "cecsel",
      STM32_RCC_D2CCIP2R,
      RCC_D2CCIP2R_CECSEL_SHIFT,
      2,
      CLK_MUX_ROUND_CLOSEST
    ),
    CLK_NAME_IS_STATIC | CLK_PARENT_NAME_IS_STATIC | CLK_SET_RATE_PARENT,
    1,
    STM32_GATE("cec_ker_ck", STM32_RCC_APB1LENR, 27, 0)
  ),
  STM32_GATED_MUX_N(
    usbsel_parents, nitems(usbsel_parents),
    STM32_MUX(
      "usbsel",
      STM32_RCC_D2CCIP2R,
      RCC_D2CCIP2R_USBSEL_SHIFT,
      2,
      CLK_MUX_ROUND_CLOSEST
    ),
    CLK_NAME_IS_STATIC | CLK_PARENT_NAME_IS_STATIC | CLK_SET_RATE_PARENT,
    1,
    STM32_GATE("usb_ker_ck", STM32_RCC_AHB1ENR, 25, 0)
  ),
  STM32_GATED_MUX_N(
    i2c123sel_parents, nitems(i2c123sel_parents),
    STM32_MUX(
      "i2c123sel",
      STM32_RCC_D2CCIP2R,
      RCC_D2CCIP2R_I2C123SEL_SHIFT,
      2,
      CLK_MUX_ROUND_CLOSEST
    ),
    CLK_NAME_IS_STATIC | CLK_PARENT_NAME_IS_STATIC | CLK_SET_RATE_PARENT,
    3,
    STM32_GATE("i2c1_ker_ck", STM32_RCC_APB1LENR, 21, 0),
    STM32_GATE("i2c2_ker_ck", STM32_RCC_APB1LENR, 22, 0),
    STM32_GATE("i2c3_ker_ck", STM32_RCC_APB1LENR, 23, 0)
  ),
  STM32_GATED_MUX_N(
    rngsel_parents, nitems(rngsel_parents),
    STM32_MUX(
      "rngsel",
      STM32_RCC_D2CCIP2R,
      RCC_D2CCIP2R_RNGSEL_SHIFT,
      2,
      CLK_MUX_ROUND_CLOSEST
    ),
    CLK_NAME_IS_STATIC | CLK_PARENT_NAME_IS_STATIC | CLK_SET_RATE_PARENT,
    1,
    STM32_GATE("rng_ker_ck", STM32_RCC_AHB2ENR, 6, 0)
  ),
  STM32_GATED_MUX_N(
    usart16sel_parents, nitems(usart16sel_parents),
    STM32_MUX(
      "usart16sel",
      STM32_RCC_D2CCIP2R,
      RCC_D2CCIP2R_USART16SEL_SHIFT,
      3,
      CLK_MUX_ROUND_CLOSEST
    ),
    CLK_NAME_IS_STATIC | CLK_PARENT_NAME_IS_STATIC,
    2,
    STM32_GATE("usart1_ker_ck", STM32_RCC_APB2ENR, 4, 0),
    STM32_GATE("usart6_ker_ck", STM32_RCC_APB2ENR, 5, 0)
  ),
  STM32_GATED_MUX_N(
    usart234578sel_parents, nitems(usart234578sel_parents),
    STM32_MUX(
      "usart234578sel",
      STM32_RCC_D2CCIP2R,
      RCC_D2CCIP2R_USART234578SEL_SHIFT,
      3,
      CLK_MUX_ROUND_CLOSEST
    ),
    CLK_NAME_IS_STATIC | CLK_PARENT_NAME_IS_STATIC | CLK_SET_RATE_PARENT,
    6,
    STM32_GATE("usart2_ker_ck", STM32_RCC_APB1LENR, 17, 0),
    STM32_GATE("usart3_ker_ck", STM32_RCC_APB1LENR, 18, 0),
    STM32_GATE("uart4_ker_ck", STM32_RCC_APB1LENR, 19, 0),
    STM32_GATE("uart5_ker_ck", STM32_RCC_APB1LENR, 20, 0),
    STM32_GATE("uart7_ker_ck", STM32_RCC_APB1LENR, 30, 0),
    STM32_GATE("uart8_ker_ck", STM32_RCC_APB1LENR, 31, 0)
  ),
  STM32_GATED_MUX_N(
    spi6sel_parents, nitems(spi6sel_parents),
    STM32_MUX(
      "spi6sel",
      STM32_RCC_D3CCIPR,
      RCC_D3CCIPR_SPI6SEL_SHIFT,
      3,
      CLK_MUX_ROUND_CLOSEST
    ),
    CLK_NAME_IS_STATIC | CLK_PARENT_NAME_IS_STATIC | CLK_SET_RATE_PARENT,
    1,
    STM32_GATE("spi6_ker_ck", STM32_RCC_APB4ENR, 5, 0)
  ),
  STM32_GATED_MUX_N(
    sai4bsel_parents, nitems(sai4bsel_parents),
    STM32_MUX(
      "sai4bsel",
      STM32_RCC_D3CCIPR,
      RCC_D3CCIPR_SAI4BSEL_SHIFT,
      3,
      CLK_MUX_ROUND_CLOSEST
    ),
    CLK_NAME_IS_STATIC | CLK_PARENT_NAME_IS_STATIC | CLK_SET_RATE_PARENT,
    1,
    STM32_GATE("sai4b_ker_ck", STM32_RCC_APB4ENR, 21, 0)
  ),
  STM32_GATED_MUX_N(
    sai4asel_parents, nitems(sai4asel_parents),
    STM32_MUX(
      "sai4asel",
      STM32_RCC_D3CCIPR,
      RCC_D3CCIPR_SAI4ASEL_SHIFT,
      3,
      CLK_MUX_ROUND_CLOSEST
    ),
    CLK_NAME_IS_STATIC | CLK_PARENT_NAME_IS_STATIC | CLK_SET_RATE_PARENT,
    1,
    STM32_GATE("sai4a_ker_ck", STM32_RCC_APB4ENR, 21, 0)
  ),
  STM32_GATED_MUX_N(
    adcsel_parents, nitems(adcsel_parents),
    STM32_MUX(
      "adcsel",
      STM32_RCC_D3CCIPR,
      RCC_D3CCIPR_ADCSEL_SHIFT,
      2,
      CLK_MUX_ROUND_CLOSEST
    ),
    CLK_NAME_IS_STATIC | CLK_PARENT_NAME_IS_STATIC | CLK_SET_RATE_PARENT,
    1,
    STM32_GATE("adc_ker_ck", STM32_RCC_AHB1ENR, 5, 0)
  ),
  STM32_GATED_MUX_N(
    lptim345sel_parents, nitems(lptim345sel_parents),
    STM32_MUX(
      "lptim345sel",
      STM32_RCC_D3CCIPR,
      RCC_D3CCIPR_LPTIM345SEL_SHIFT,
      3,
      CLK_MUX_ROUND_CLOSEST
    ),
    CLK_NAME_IS_STATIC | CLK_PARENT_NAME_IS_STATIC | CLK_SET_RATE_PARENT,
    3,
    STM32_GATE("lptim3_ker_ck", STM32_RCC_APB4ENR, 3, 0),
    STM32_GATE("lptim4_ker_ck", STM32_RCC_APB4ENR, 4, 0),
    STM32_GATE("lptim5_ker_ck", STM32_RCC_APB4ENR, 5, 0)
  ),
  STM32_GATED_MUX_N(
    lptim2sel_parents, nitems(lptim2sel_parents),
    STM32_MUX(
      "lptim2sel",
      STM32_RCC_D3CCIPR,
      RCC_D3CCIPR_LPTIM2SEL_SHIFT,
      3,
      CLK_MUX_ROUND_CLOSEST
    ),
    CLK_NAME_IS_STATIC | CLK_PARENT_NAME_IS_STATIC | CLK_SET_RATE_PARENT,
    1,
    STM32_GATE("lptim2_ker_ck", STM32_RCC_APB4ENR, 9, 0)
  ),
  STM32_GATED_MUX_N(
    i2c4sel_parents, nitems(i2c4sel_parents),
    STM32_MUX(
      "i2c4sel",
      STM32_RCC_D3CCIPR,
      RCC_D3CCIPR_I2C4SEL_SHIFT,
      2,
      CLK_MUX_ROUND_CLOSEST
    ),
    CLK_NAME_IS_STATIC | CLK_PARENT_NAME_IS_STATIC | CLK_SET_RATE_PARENT,
    1,
    STM32_GATE("i2c4_ker_ck", STM32_RCC_APB4ENR, 7, 0)
  ),
  STM32_GATED_MUX_N(
    lpuart1sel_parents, nitems(lpuart1sel_parents),
    STM32_MUX(
      "lpuart1sel",
      STM32_RCC_D3CCIPR,
      RCC_D3CCIPR_LPUART1SEL_SHIFT,
      3,
      CLK_MUX_ROUND_CLOSEST
    ),
    CLK_NAME_IS_STATIC | CLK_PARENT_NAME_IS_STATIC | CLK_SET_RATE_PARENT,
    1,
    STM32_GATE("lpuart1_ker_ck", STM32_RCC_APB4ENR, 3, 0)
  ),
};

/* STM32H7 RTC clock parent names */

static const char * const rtcsel_parents[] =
{
  "off", "lse_ck_gate", "lsi_ck_gate", "hse_ck_gate"
};

