apache/nuttx/arch/arm/src/stm32h7/stm32_clk.c
/* STM32H7 RTC clock */

static const struct stm32_gated_mux_s stm32h7_rtcsel =
  STM32_GATED_MUX_N(
    rtcsel_parents, nitems(rtcsel_parents),
    STM32_MUX(
      "rtcsel",
      STM32_RCC_BDCR,
      RCC_BDCR_RTCSEL_SHIFT,
      2,
      CLK_MUX_ROUND_CLOSEST
    ),
    CLK_NAME_IS_STATIC | CLK_PARENT_NAME_IS_STATIC,
    1,
    STM32_GATE("rcc_rtc_ck", STM32_RCC_BDCR, 15, 0)
  );

/* STM32H7 MCO clocks parent names */

static const char * const mco1_parents[] =
{
  "hsi_ck", "lse_ck", "hse_ck", "pll1_q_ck", "hsi48_ck"
};

static const char * const mco2_parents[] =
{
  "sys_ck", "pll2_p_ck", "hse_ck",
  "pll1_p_ck", "csi_ck", "lsi_ck"
};

/* STM32H7 MCO clocks */

static const struct stm32_divided_mux_n_s stm32h7_mco[] =
{
  STM32_DIVIDED_MUX_N(
    mco1_parents,
    nitems(mco1_parents),
    STM32_MUX(
      "mco1",
      STM32_RCC_CFGR,
      RCC_CFGR_MCO1_SHIFT,
      3,
      0
    ),
    CLK_NAME_IS_STATIC | CLK_PARENT_NAME_IS_STATIC,
    1,
    STM32_DIVIDER(
      "mco1pre",
      STM32_RCC_CFGR,
      RCC_CFGR_MCO1PRE_SHIFT,
      4,
      CLK_DIVIDER_POWER_OF_TWO
    )
  ),
  STM32_DIVIDED_MUX_N(
    mco2_parents,
    nitems(mco2_parents),
    STM32_MUX(
      "mco2",
      STM32_RCC_CFGR,
      RCC_CFGR_MCO2_SHIFT,
      3,
      0
    ),
    CLK_NAME_IS_STATIC | CLK_PARENT_NAME_IS_STATIC,
    1,
    STM32_DIVIDER(
      "mco2pre",
      STM32_RCC_CFGR,
      RCC_CFGR_MCO2PRE_SHIFT,
      4,
      CLK_DIVIDER_POWER_OF_TWO
    )
  ),
};

/* STM32H7 GPIO gates */

static const struct stm32_gate_s stm32h7_gpio_gates[] =
{
  STM32_GATE("gpioa_ker_ck", STM32_RCC_AHB4ENR, 0, 0),
  STM32_GATE("gpiob_ker_ck", STM32_RCC_AHB4ENR, 1, 0),
  STM32_GATE("gpioc_ker_ck", STM32_RCC_AHB4ENR, 2, 0),
  STM32_GATE("gpiod_ker_ck", STM32_RCC_AHB4ENR, 3, 0),
  STM32_GATE("gpioe_ker_ck", STM32_RCC_AHB4ENR, 4, 0),
  STM32_GATE("gpiof_ker_ck", STM32_RCC_AHB4ENR, 5, 0),
  STM32_GATE("gpiog_ker_ck", STM32_RCC_AHB4ENR, 6, 0),
  STM32_GATE("gpioh_ker_ck", STM32_RCC_AHB4ENR, 7, 0),
  STM32_GATE("gpioi_ker_ck", STM32_RCC_AHB4ENR, 8, 0),
  STM32_GATE("gpioj_ker_ck", STM32_RCC_AHB4ENR, 9, 0),
  STM32_GATE("gpiok_ker_ck", STM32_RCC_AHB4ENR, 10, 0),
};

/* STM32H7 APB1 timer gates (parent: cdppre1) */

static const struct stm32_gate_s stm32h7_apb1_tim_gates[] =
{
  STM32_GATE("tim2_ker_ck", STM32_RCC_APB1LENR, 0, 0),
  STM32_GATE("tim3_ker_ck", STM32_RCC_APB1LENR, 1, 0),
  STM32_GATE("tim4_ker_ck", STM32_RCC_APB1LENR, 2, 0),
  STM32_GATE("tim5_ker_ck", STM32_RCC_APB1LENR, 3, 0),
  STM32_GATE("tim6_ker_ck", STM32_RCC_APB1LENR, 4, 0),
  STM32_GATE("tim7_ker_ck", STM32_RCC_APB1LENR, 5, 0),
  STM32_GATE("tim12_ker_ck", STM32_RCC_APB1LENR, 6, 0),
  STM32_GATE("tim13_ker_ck", STM32_RCC_APB1LENR, 7, 0),
  STM32_GATE("tim14_ker_ck", STM32_RCC_APB1LENR, 8, 0),
};

/* STM32H7 APB2 timer gates (parent: cdppre2) */

static const struct stm32_gate_s stm32h7_apb2_tim_gates[] =
{
  STM32_GATE("tim1_ker_ck", STM32_RCC_APB2ENR, 0, 0),
  STM32_GATE("tim8_ker_ck", STM32_RCC_APB2ENR, 1, 0),
  STM32_GATE("tim15_ker_ck", STM32_RCC_APB2ENR, 16, 0),
  STM32_GATE("tim16_ker_ck", STM32_RCC_APB2ENR, 17, 0),
  STM32_GATE("tim17_ker_ck", STM32_RCC_APB2ENR, 18, 0),
};

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

static int
stm32_register_gated_osc(const struct stm32_gated_fixed_rate_s *osc);
static int
stm32_register_pll(const struct stm32_pll_s *pll);
static int
stm32_register_sysclk(const struct stm32_sysclk_s *sysclk);
static int
stm32_register_gated_mux(const struct stm32_gated_mux_s *gated_mux);
static int
stm32_register_divided_mux_n(const struct stm32_divided_mux_n_s *divided_mux_n);

/****************************************************************************
 * Private Functions
 ****************************************************************************/

static int
stm32_register_gated_osc(const struct stm32_gated_fixed_rate_s *osc)
{
  struct clk_s *fixed_rate_clk;
  struct clk_s *gate_clk;
  int i;

  /* Register the fixed rate clock */

  fixed_rate_clk = clk_register_fixed_rate(
    osc->fixed_rate.fixed_rate_name,
    NULL,
    osc->base_flags,
    osc->fixed_rate.fixed_rate.fixed_rate
  );
  if (fixed_rate_clk == NULL)
    {
      return -ENOMEM;
    }

  /* Register all gate clocks using the fixed rate as parent */

  for (i = 0; i < osc->num_gates; i++)
    {
      gate_clk = clk_register_gate(
        osc->gates[i].gate_name,
        osc->fixed_rate.fixed_rate_name,
        osc->base_flags,
        osc->gates[i].gate.reg,
        osc->gates[i].gate.bit_idx,
        osc->gates[i].gate.flags
      );
      if (gate_clk == NULL)
        {
          return -ENOMEM;
        }
    }

  return OK;
}

static int
stm32_register_sysclk(const struct stm32_sysclk_s *sysclk)
{
  struct clk_s *mux_clk;
  struct clk_s *div_clk;

  /* Register the sysclk mux */

  mux_clk = clk_register_mux(
    sysclk->sysclk_mux.mux_name,
    sysclk->sysclk_parent_names,
    sysclk->sysclk_parent_names_count,
    sysclk->base_flags,
    sysclk->sysclk_mux.mux.reg,
    sysclk->sysclk_mux.mux.shift,
    sysclk->sysclk_mux.mux.width,
    sysclk->sysclk_mux.mux.flags
  );

  if (mux_clk == NULL)
    {
      return -ENOMEM;
    }

  /* Register the traceclk mux */

  mux_clk = clk_register_mux(
    sysclk->traceclk_mux.mux_name,
    sysclk->traceclk_parent_names,
    sysclk->traceclk_parent_names_count,
    sysclk->base_flags,
    sysclk->traceclk_mux.mux.reg,
    sysclk->traceclk_mux.mux.shift,
    sysclk->traceclk_mux.mux.width,
    sysclk->traceclk_mux.mux.flags
  );

  if (mux_clk == NULL)
    {
      return -ENOMEM;
    }

  /* Register cdcpre divider */

  div_clk = clk_register_divider(
    sysclk->cdcpre.div_name,
    sysclk->sysclk_mux.mux_name,
    sysclk->base_flags,
    sysclk->cdcpre.div.reg,
    sysclk->cdcpre.div.shift,
    sysclk->cdcpre.div.width,
    sysclk->cdcpre.div.flags
  );
  if (div_clk == NULL)
    {
      return -ENOMEM;
    }

