apache/nuttx/arch/arm/src/stm32h7/stm32_clk.c
  /* Register hpre divider */

  div_clk = clk_register_divider(
    sysclk->hpre.div_name,
    sysclk->cdcpre.div_name,
    sysclk->base_flags,
    sysclk->hpre.div.reg,
    sysclk->hpre.div.shift,
    sysclk->hpre.div.width,
    sysclk->hpre.div.flags
  );

  if (div_clk == NULL)
    {
      return -ENOMEM;
    }

  /* Register cdppre divider */

  div_clk = clk_register_divider(
    sysclk->cdppre.div_name,
    sysclk->hpre.div_name,
    sysclk->base_flags,
    sysclk->cdppre.div.reg,
    sysclk->cdppre.div.shift,
    sysclk->cdppre.div.width,
    sysclk->cdppre.div.flags
  );

  if (div_clk == NULL)
    {
      return -ENOMEM;
    }

  /* Register cdppre1 divider */

  div_clk = clk_register_divider(
    sysclk->cdppre1.div_name,
    sysclk->hpre.div_name,
    sysclk->base_flags,
    sysclk->cdppre1.div.reg,
    sysclk->cdppre1.div.shift,
    sysclk->cdppre1.div.width,
    sysclk->cdppre1.div.flags
  );

  if (div_clk == NULL)
    {
      return -ENOMEM;
    }

  /* Register cdppre2 divider */

  div_clk = clk_register_divider(
    sysclk->cdppre2.div_name,
    sysclk->hpre.div_name,
    sysclk->base_flags,
    sysclk->cdppre2.div.reg,
    sysclk->cdppre2.div.shift,
    sysclk->cdppre2.div.width,
    sysclk->cdppre2.div.flags
  );
  if (div_clk == NULL)
    {
      return -ENOMEM;
    }

  /* Register sdrppre divider */

  div_clk = clk_register_divider(
    sysclk->sdrppre.div_name,
    sysclk->cdcpre.div_name,
    sysclk->base_flags,
    sysclk->sdrppre.div.reg,
    sysclk->sdrppre.div.shift,
    sysclk->sdrppre.div.width,
    sysclk->sdrppre.div.flags
  );
  if (div_clk == NULL)
    {
      return -ENOMEM;
    }

  return OK;
}

static int
stm32_register_pll(const struct stm32_pll_s *pll)
{
  struct clk_s *mult_clk;
  struct clk_s *div_clk;
  struct clk_s *gate_clk;

  /* Register the PLL multiplier (divn) */

  mult_clk = clk_register_multiplier(
    pll->divn.mult_name,
    pll->parent_name,
    pll->base_flags,
    pll->divn.mult.reg,
    pll->divn.mult.shift,
    pll->divn.mult.width,
    pll->divn.mult.flags
  );
  if (mult_clk == NULL)
    {
      return -ENOMEM;
    }

  /* Register divp divider */

  div_clk = clk_register_divider(
    pll->divp.div_name,
    pll->divn.mult_name,
    pll->base_flags,
    pll->divp.div.reg,
    pll->divp.div.shift,
    pll->divp.div.width,
    pll->divp.div.flags
  );
  if (div_clk == NULL)
    {
      return -ENOMEM;
    }

  /* Register divp gate */

  gate_clk = clk_register_gate(
    pll->gatep.gate_name,
    pll->divp.div_name,
    pll->base_flags,
    pll->gatep.gate.reg,
    pll->gatep.gate.bit_idx,
    pll->gatep.gate.flags
  );
  if (gate_clk == NULL)
    {
      return -ENOMEM;
    }

  /* Register divq divider */

  div_clk = clk_register_divider(
    pll->divq.div_name,
    pll->divn.mult_name,
    pll->base_flags,
    pll->divq.div.reg,
    pll->divq.div.shift,
    pll->divq.div.width,
    pll->divq.div.flags
  );
  if (div_clk == NULL)
    {
      return -ENOMEM;
    }

  /* Register divq gate */

  gate_clk = clk_register_gate(
    pll->gateq.gate_name,
    pll->divq.div_name,
    pll->base_flags,
    pll->gateq.gate.reg,
    pll->gateq.gate.bit_idx,
    pll->gateq.gate.flags
  );
  if (gate_clk == NULL)
    {
      return -ENOMEM;
    }

  /* Register divr divider */

  div_clk = clk_register_divider(
    pll->divr.div_name,
    pll->divn.mult_name,
    pll->base_flags,
    pll->divr.div.reg,
    pll->divr.div.shift,
    pll->divr.div.width,
    pll->divr.div.flags
  );
  if (div_clk == NULL)
    {
      return -ENOMEM;
    }

  /* Register divr gate */

  gate_clk = clk_register_gate(
    pll->gater.gate_name,
    pll->divr.div_name,
    pll->base_flags,
    pll->gater.gate.reg,
    pll->gater.gate.bit_idx,
    pll->gater.gate.flags
  );
  if (gate_clk == NULL)
    {
      return -ENOMEM;
    }

  return OK;
}

static int
stm32_register_gated_mux(const struct stm32_gated_mux_s *gated_mux)
{
  struct clk_s *mux_clk;
  struct clk_s *gate_clk;
  int i;

  /* Register the mux */

  mux_clk = clk_register_mux(
    gated_mux->mux.mux_name,
    gated_mux->parent_names,
    gated_mux->parent_names_count,
    gated_mux->base_flags,
    gated_mux->mux.mux.reg,
    gated_mux->mux.mux.shift,
    gated_mux->mux.mux.width,
    gated_mux->mux.mux.flags
  );
  if (mux_clk == NULL)
    {
      return -ENOMEM;
    }

  /* Register all gate clocks */

  for (i = 0; i < gated_mux->num_gates; i++)
    {
      gate_clk = clk_register_gate(
        gated_mux->gates[i].gate_name,
        gated_mux->mux.mux_name,
        gated_mux->base_flags,
        gated_mux->gates[i].gate.reg,
        gated_mux->gates[i].gate.bit_idx,
        gated_mux->gates[i].gate.flags
      );
      if (gate_clk == NULL)
        {
          return -ENOMEM;
        }
    }

  return OK;
}

static int
stm32_register_divided_mux_n(const struct stm32_divided_mux_n_s *divided_mux_n)
{
  struct clk_s *mux_clk;
  struct clk_s *div_clk;
  int i;

  /* Register the mux */

  mux_clk = clk_register_mux(
    divided_mux_n->mux.mux_name,
    divided_mux_n->parent_names,
    divided_mux_n->parent_names_count,
    divided_mux_n->base_flags,
    divided_mux_n->mux.mux.reg,
    divided_mux_n->mux.mux.shift,
    divided_mux_n->mux.mux.width,
    divided_mux_n->mux.mux.flags
  );
  if (mux_clk == NULL)
    {
      return -ENOMEM;
    }

  /* Register all dividers */

  for (i = 0; i < divided_mux_n->num_divs; i++)
    {
      div_clk = clk_register_divider(
        divided_mux_n->divs[i].div_name,
        divided_mux_n->mux.mux_name,
        divided_mux_n->base_flags,
        divided_mux_n->divs[i].div.reg,
        divided_mux_n->divs[i].div.shift,
        divided_mux_n->divs[i].div.width,
        divided_mux_n->divs[i].div.flags
      );
      if (div_clk == NULL)
        {
          return -ENOMEM;
        }
    }

  return OK;
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: up_clk_register
 *
 * Description:
 *   Initialize the STM32H7 clock system using common clock framework
 *
 ****************************************************************************/

