apache/nuttx/arch/arm/src/stm32h7/stm32_clk.c
void up_clk_register()
{
  int i;
  int ret;
  struct clk_s *hsidiv_clk;

  /* Register HSI divider */

  hsidiv_clk = clk_register_divider(
    "hsi_div",
    "hsi",
    CLK_NAME_IS_STATIC | CLK_PARENT_NAME_IS_STATIC,
    STM32_RCC_CR,
    RCC_CR_HSIDIV_SHIFT,
    2,
    CLK_DIVIDER_POWER_OF_TWO
  );
  if (hsidiv_clk == NULL)
    {
      /* Handle error */
    }

  /* Register HSI gates */

  hsidiv_clk = clk_register_gate(
    "hsi_ck",
    "hsi_div",
    CLK_NAME_IS_STATIC | CLK_PARENT_NAME_IS_STATIC,
    STM32_RCC_CR,
    0,
    0
  );
  if (hsidiv_clk == NULL)
    {
      /* Handle error */
    }

  hsidiv_clk = clk_register_gate(
    "hsi_ker_ck",
    "hsi_div",
    CLK_NAME_IS_STATIC | CLK_PARENT_NAME_IS_STATIC,
    STM32_RCC_CR,
    1,
    0
  );
  if (hsidiv_clk == NULL)
    {
      /* Handle error */
    }

  /* Register all gated oscillators */

  for (i = 0;
       i < sizeof(stm32h7_gated_oscs) / sizeof(stm32h7_gated_oscs[0]);
       i++)
    {
      ret = stm32_register_gated_osc(&stm32h7_gated_oscs[i]);
      if (ret < 0)
        {
          /* Continue with other oscillators even if one fails */
        }
    }

  /* Register PLL clock selection */

  ret = stm32_register_divided_mux_n(&stm32h7_pll_cksel);
  if (ret < 0)
    {
      /* Handle error */
    }

  /* Register all PLLs */

  for (i = 0; i < sizeof(stm32h7_plls) / sizeof(stm32h7_plls[0]); i++)
    {
      ret = stm32_register_pll(&stm32h7_plls[i]);
      if (ret < 0)
        {
          /* Continue with other PLLs even if one fails */
        }
    }

  /* Register system clock */

  ret = stm32_register_sysclk(&stm32h7_sysclk);
  if (ret < 0)
    {
      /* Handle error */
    }

  /* Register all gated muxes */

  for (i = 0;
       i < sizeof(stm32h7_gated_muxes) / sizeof(stm32h7_gated_muxes[0]);
       i++)
    {
      ret = stm32_register_gated_mux(&stm32h7_gated_muxes[i]);
      if (ret < 0)
        {
          /* Continue with other muxes even if one fails */
        }
    }

  /* Register RTC clock */

  ret = stm32_register_gated_mux(&stm32h7_rtcsel);
  if (ret < 0)
    {
      /* Handle error */
    }

  /* Register MCO clocks */

  for (i = 0; i < sizeof(stm32h7_mco) / sizeof(stm32h7_mco[0]); i++)
    {
      ret = stm32_register_divided_mux_n(&stm32h7_mco[i]);
      if (ret < 0)
        {
          /* Continue with other MCO clocks even if one fails */
        }
    }

  /* Register GPIO clocks */

  for (i = 0;
       i < sizeof(stm32h7_gpio_gates) / sizeof(stm32h7_gpio_gates[0]);
       i++)
    {
      clk_register_gate(
        stm32h7_gpio_gates[i].gate_name,
        "hpre",
        CLK_NAME_IS_STATIC | CLK_PARENT_NAME_IS_STATIC,
        stm32h7_gpio_gates[i].gate.reg,
        stm32h7_gpio_gates[i].gate.bit_idx,
        stm32h7_gpio_gates[i].gate.flags
      );
    }

  /* Register APB1 timer clocks */

  for (i = 0;
       i < sizeof(stm32h7_apb1_tim_gates) / sizeof(stm32h7_apb1_tim_gates[0]);
       i++)
    {
      clk_register_gate(
        stm32h7_apb1_tim_gates[i].gate_name,
        "cdppre1",
        CLK_NAME_IS_STATIC | CLK_PARENT_NAME_IS_STATIC,
        stm32h7_apb1_tim_gates[i].gate.reg,
        stm32h7_apb1_tim_gates[i].gate.bit_idx,
        stm32h7_apb1_tim_gates[i].gate.flags
      );
    }

  /* Register APB2 timer clocks */

  for (i = 0;
       i < sizeof(stm32h7_apb2_tim_gates) / sizeof(stm32h7_apb2_tim_gates[0]);
       i++)
    {
      clk_register_gate(
        stm32h7_apb2_tim_gates[i].gate_name,
        "cdppre2",
        CLK_NAME_IS_STATIC | CLK_PARENT_NAME_IS_STATIC,
        stm32h7_apb2_tim_gates[i].gate.reg,
        stm32h7_apb2_tim_gates[i].gate.bit_idx,
        stm32h7_apb2_tim_gates[i].gate.flags
      );
    }
}
